# Data frame

In [9]:
import pandas as pd

In [10]:
l = [2,5,6,8,7,9,6,3,5,6]

var = pd.DataFrame(l)

var

   0
0  2
1  5
2  6
3  8
4  7
5  9
6  6
7  3
8  5
9  6

In [11]:
d = {"a":[12,45,56,78],"b":[25,63,45,78],"c":[32,68,95,16]}

var2 = pd.DataFrame(d)


var2

    a   b   c
0  12  25  32
1  45  63  68
2  56  45  95
3  78  78  16

In [12]:
da = {"a":[12,45,56,78],"b":[25,63,45,78],"c":[32,68,95,16]}

var2 = pd.DataFrame(da,index=["2","2","2","2"])


var2                #updating index

    a   b   c
2  12  25  32
2  45  63  68
2  56  45  95
2  78  78  16

In [15]:
k = {"x":[12,45,56,78],"y":[25,63,45,78],"z":[32,68,95,16]}

t = pd.DataFrame(k,columns=["y"])


t                        #slicing  with columns

    y
0  25
1  63
2  45
3  78

In [19]:
w = {"x":[12,45,56,78],"y":[25,63,45,78]}

t = pd.DataFrame(w)

print (t["y"][2])                      # slicing with values

45

In [21]:
l  = [[2,5,6,8,7,9,6,3,5,6],[2,5,3,9,7,5,3,6,1,7]]

l2 = pd.DataFrame(l)



print(l2)
print(type(l2))


       #we create nested list with Data Frame

   0  1  2  3  4  5  6  7  8  9
0  2  5  6  8  7  9  6  3  5  6
1  2  5  3  9  7  5  3  6  1  7
<class 'pandas.core.frame.DataFrame'>

In [23]:
d = {"a":pd.Series([2,5,6,8,7,3]),"b":pd.Series([2,3,4,6,4,7])}

dd = pd.DataFrame(d)

dd


#  {([]) }

   a  b
0  2  2
1  5  3
2  6  4
3  8  6
4  7  4
5  3  7